/************************************************************************************

程序名称：串口1通讯函数（晶振频率11.0592MHz）  
功能说明: 串口1初始化,字符发送与字符串发送函数,波特率9600bps

************************************************************************************/ 

#include "stc15f2k60s2.h"
#include "intrins.h"


/*----------------------------
串口初始化
----------------------------*/

void UartInit(void)		//9600bps@18.432MHz
{

	SCON = 0x50;		//8位数据,可变波特率
	AUXR = 0x15;		//定时器2时钟为Fosc,即1T
    T2L=(65536-11059200/4/9600);     
    T2H=(65536-11059200/4/9600)>>8;	
	ET1 = 0;			//禁止定时器1中断
	ES=1;

}


/*----------------------------
发送串口数据
----------------------------*/
void SendData(unsigned char ch)
{
    SBUF = ch;                 //写数据到UART数据寄存器
		while(TI == 0);
		TI = 0;
}

/*----------------------------
发送字符串
----------------------------*/
void SendString(char *s)
{
    while (*s)                  //检测字符串结束标志
    {
        SendData(*s++);         //发送当前字符
    }
}


